In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:

dic={'A':['x','x','y','y','a'] , 'B': ['p','s','p','s','p'], 'C':[11,2,5,3,4] , 'D':[11,2,5,3,4]}
x= [['first', 'first','second','third' ,'third'] , ['car','car','motor','motor','car']]     
df = pd.DataFrame(dic)
df

   A  B   C   D
0  x  p  11  11
1  x  s   2   2
2  y  p   5   5
3  y  s   3   3
4  a  p   4   4

In [3]:
index_ = pd.MultiIndex.from_arrays(x,names = ["rank","vehicle"])
index_

MultiIndex([( 'first',   'car'),
            ( 'first',   'car'),
            ('second', 'motor'),
            ( 'third', 'motor'),
            ( 'third',   'car')],
           names=['rank', 'vehicle'])

In [4]:
df2 = pd.DataFrame({'M':['x','x','y','y','a'],'N':[11,2,5,3,4]})
df2

   M   N
0  x  11
1  x   2
2  y   5
3  y   3
4  a   4

In [5]:
df2.groupby("M")["N"].sum()

M
a     4
x    13
y     8
Name: N, dtype: int64

In [6]:
df2.groupby("M")["N"].mean()

M
a    4.0
x    6.5
y    4.0
Name: N, dtype: float64

In [7]:
df2.groupby(["M"]).sum()

    N
M
a   4
x  13
y   8

In [8]:
df2.groupby(["M"],sort=False).sum()

    N
M
x  13
y   8
a   4

In [9]:
df2.groupby(["M"],sort=True).sum()

    N
M
a   4
x  13
y   8

In [10]:
#.group to get all groups
g = df2.groupby(["M"])
g.groups

{'a': [4], 'x': [0, 1], 'y': [2, 3]}

In [11]:
g.get_group("x")#to get group item

   M   N
0  x  11
1  x   2

In [12]:
g.get_group("x").sum()

M    xx
N    13
dtype: object

In [13]:
g.get_group("x")["N"].sum()

13

In [14]:
df

   A  B   C   D
0  x  p  11  11
1  x  s   2   2
2  y  p   5   5
3  y  s   3   3
4  a  p   4   4

In [15]:
df.index = index_
df

                A  B   C   D
rank   vehicle
first  car      x  p  11  11
       car      x  s   2   2
second motor    y  p   5   5
third  motor    y  s   3   3
       car      a  p   4   4

In [16]:
g1 = df.groupby(["rank","vehicle"])

In [17]:
g1.groups

{('first', 'car'): [('first', 'car'), ('first', 'car')], ('second', 'motor'): [('second', 'motor')], ('third', 'car'): [('third', 'car')], ('third', 'motor'): [('third', 'motor')]}

In [18]:
g1.get_group(('first', 'car'))

               A  B   C   D
rank  vehicle
first car      x  p  11  11
      car      x  s   2   2

In [19]:
g1.get_group(('second', 'motor'))

                A  B  C  D
rank   vehicle
second motor    y  p  5  5

In [20]:
g2 = df.groupby(["A","B"])

In [21]:
h = g2.groups
type(h)

pandas.io.formats.printing.PrettyDict

In [22]:
j = dict(g2.groups)
j.keys()

dict_keys([('a', 'p'), ('x', 'p'), ('x', 's'), ('y', 'p'), ('y', 's')])

In [23]:
for i,j in g2:
    print(i)
    print(j)

('a', 'p')
               A  B  C  D
rank  vehicle
third car      a  p  4  4
('x', 'p')
               A  B   C   D
rank  vehicle
first car      x  p  11  11
('x', 's')
               A  B  C  D
rank  vehicle
first car      x  s  2  2
('y', 'p')
                A  B  C  D
rank   vehicle
second motor    y  p  5  5
('y', 's')
               A  B  C  D
rank  vehicle
third motor    y  s  3  3

In [62]:
g3 = df["C"].groupby(level=0)

In [63]:
print(g3.groups)

{'first': [('first', 'car'), ('first', 'car')], 'second': [('second', 'motor')], 'third': [('third', 'motor'), ('third', 'car')]}

In [65]:
df["C"].groupby(level=1).groups

{'car': [('first', 'car'), ('first', 'car'), ('third', 'car')], 'motor': [('second', 'motor'), ('third', 'motor')]}

In [26]:
g3.sum()

rank
first     13
second     5
third      7
Name: C, dtype: int64

In [27]:
df

                A  B   C   D
rank   vehicle
first  car      x  p  11  11
       car      x  s   2   2
second motor    y  p   5   5
third  motor    y  s   3   3
       car      a  p   4   4

In [28]:
df["C"].groupby(level=1).sum()

vehicle
car      17
motor     8
Name: C, dtype: int64

In [29]:
df["C"].groupby(level=["rank","vehicle"]).sum()

rank    vehicle
first   car        13
second  motor       5
third   car         4
        motor       3
Name: C, dtype: int64

In [30]:
df["C"].groupby(level=["rank","vehicle"]).mean()

rank    vehicle
first   car        6.5
second  motor      5.0
third   car        4.0
        motor      3.0
Name: C, dtype: float64

In [31]:
df

                A  B   C   D
rank   vehicle
first  car      x  p  11  11
       car      x  s   2   2
second motor    y  p   5   5
third  motor    y  s   3   3
       car      a  p   4   4

In [32]:
g4 = df.groupby([pd.Grouper(level = 0),"A"])

In [33]:
g4.groups

{('first', 'x'): [('first', 'car'), ('first', 'car')], ('second', 'y'): [('second', 'motor')], ('third', 'a'): [('third', 'car')], ('third', 'y'): [('third', 'motor')]}

In [34]:
g4.sum()

           C   D
rank   A
first  x  13  13
second y   5   5
third  a   4   4
       y   3   3

In [35]:
h1  =df.groupby(["rank","A"])

In [36]:
h1.sum()

           C   D
rank   A
first  x  13  13
second y   5   5
third  a   4   4
       y   3   3

In [37]:
g5 = df.groupby("rank")
g5.groups

{'first': [('first', 'car'), ('first', 'car')], 'second': [('second', 'motor')], 'third': [('third', 'motor'), ('third', 'car')]}

In [38]:
g5["C"].sum()

rank
first     13
second     5
third      7
Name: C, dtype: int64

In [39]:
df_copy = df.reset_index()

In [40]:
df_copy

     rank vehicle  A  B   C   D
0   first     car  x  p  11  11
1   first     car  x  s   2   2
2  second   motor  y  p   5   5
3   third   motor  y  s   3   3
4   third     car  a  p   4   4

In [41]:
df_copy.set_index(["rank","vehicle"])

                A  B   C   D
rank   vehicle
first  car      x  p  11  11
       car      x  s   2   2
second motor    y  p   5   5
third  motor    y  s   3   3
       car      a  p   4   4

In [42]:
df_copy

     rank vehicle  A  B   C   D
0   first     car  x  p  11  11
1   first     car  x  s   2   2
2  second   motor  y  p   5   5
3   third   motor  y  s   3   3
4   third     car  a  p   4   4

In [43]:
d = {"animal":["cat",'cat','dog','dog','rat'],"rank":['a','b','a','a','b'],"N":[11,2,3,4,5],"Rate":[10,12,8,9,3]}
df4 = pd.DataFrame(d)
df4

  animal rank   N  Rate
0    cat    a  11    10
1    cat    b   2    12
2    dog    a   3     8
3    dog    a   4     9
4    rat    b   5     3

In [44]:
g5 = df4.groupby("animal")

In [45]:
g5.groups

{'cat': [0, 1], 'dog': [2, 3], 'rat': [4]}

In [46]:
g5.sum()

         N  Rate
animal
cat     13    22
dog      7    17
rat      5     3

In [47]:
g7 = df4.groupby("animal",as_index=False)

In [48]:
g7.sum()

  animal   N  Rate
0    cat  13    22
1    dog   7    17
2    rat   5     3

In [49]:
g5.mean()

          N  Rate
animal
cat     6.5  11.0
dog     3.5   8.5
rat     5.0   3.0

In [50]:
g5.aggregate(np.sum)

         N  Rate
animal
cat     13    22
dog      7    17
rat      5     3

In [51]:
g5.agg(np.sum)

         N  Rate
animal
cat     13    22
dog      7    17
rat      5     3

In [52]:
g5_ = df4.groupby(["animal","rank"])

In [53]:
g5_.size()

animal  rank
cat     a       1
        b       1
dog     a       2
rat     b       1
dtype: int64

In [54]:
g5.agg(np.sum)

         N  Rate
animal
cat     13    22
dog      7    17
rat      5     3

In [55]:
g5.aggregate(np.sum)

         N  Rate
animal
cat     13    22
dog      7    17
rat      5     3

In [56]:
g5_.describe()

                N                                                  Rate        \
            count  mean       std   min    25%   50%    75%   max count  mean
animal rank
cat    a      1.0  11.0       NaN  11.0  11.00  11.0  11.00  11.0   1.0  10.0
       b      1.0   2.0       NaN   2.0   2.00   2.0   2.00   2.0   1.0  12.0
dog    a      2.0   3.5  0.707107   3.0   3.25   3.5   3.75   4.0   2.0   8.5
rat    b      1.0   5.0       NaN   5.0   5.00   5.0   5.00   5.0   1.0   3.0


                  std   min    25%   50%    75%   max
animal rank
cat    a          NaN  10.0  10.00  10.0  10.00  10.0
       b          NaN  12.0  12.00  12.0  12.00  12.0
dog    a     0.707107   8.0   8.25   8.5   8.75   9.0
rat    b          NaN   3.0   3.00   3.0   3.00   3.0

In [57]:
g5_["Rate"].agg([np.sum,np.mean])

             sum  mean
animal rank
cat    a      10  10.0
       b      12  12.0
dog    a      17   8.5
rat    b       3   3.0

In [58]:
g5_.agg([np.sum,np.mean,np.std])

              N                 Rate
            sum  mean       std  sum  mean       std
animal rank
cat    a     11  11.0       NaN   10  10.0       NaN
       b      2   2.0       NaN   12  12.0       NaN
dog    a      7   3.5  0.707107   17   8.5  0.707107
rat    b      5   5.0       NaN    3   3.0       NaN

In [59]:
g5_["Rate"].agg([np.sum,np.mean]).rename(columns={"sum":"Total","mean":"AVG"})

             Total   AVG
animal rank
cat    a        10  10.0
       b        12  12.0
dog    a        17   8.5
rat    b         3   3.0